run/pizzarelli/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (20 0 0);

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient;
    }
    middlePlane
    {
        type            symmetryPlane;  
    }        
    sideWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    hot
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    cold
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
