run/pizzarelli/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
38400
(
8.47656e+06
8.42969e+06
8.38281e+06
8.33594e+06
8.28906e+06
8.24219e+06
8.19531e+06
8.14844e+06
...
)
;

boundaryField
{
    inlet
    {
        type            totalPressure;
        rho             rho;
        psi             none;
        gamma           1.74;
        p0              uniform 9e+06;
        value           uniform 9e+06;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 7e+06;
    }
    middlePlane
    {
        type            symmetryPlane;
    }
    sideWall
    {
        type            zeroGradient;
    }
    hot
    {
        type            zeroGradient;
    }
    cold
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
