run/pizzarelli/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0      0       0)
    (0      0.05     0)
    (0      0.05     0.8)
    (0      0       0.8)
    (30    0       0)  
    (30    0.05     0)
    (30    0.05     0.8)
    (30    0       0.8)  
);

edges
(
);

blocks
(
    hex (0 4 5 1 3 7 6 2) (32 20 60) simpleGrading (1 0.2 -5)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 2 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    
    middlePlane
    {
        type symmetryPlane;
        faces
        (
            (0 3 7 4)
        );
    }
    sideWall
    {
        type wall;
        faces
        (
            (1 2 6 5)
        );
    }
    hot
    {
        type wall;
        faces
        (
            (0 4 5 1)
        );
    }
    cold
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
);

mergePatchPairs
(
);

