run/pizzarelli/system/fvSolution
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "system";
 object fvSolution;
}

solvers
{
  "(p|p_rgh)"
  {
    solver GAMG;
    tolerance 1e-08;
    relTol 0.001;
    maxIter 1000;
    smoother DICGaussSeidel;
    cacheAgglomeration yes;
    nCellsInCoarsestLevel 20;
    agglomerator faceAreaPair;
    mergeLevels 1;
  }
  "(U|h|k|epsilon|omega|nuTilda)"
  {
    solver PBiCG;
    preconditioner DILU;
    tolerance 1e-08;
    relTol 0;
  }
}

SIMPLE
{
  nNonOrthogonalCorrectors 0;
  rhoMin rhoMin       [ 1 -3 0 0 0 0 0 ]       10 ;
  rhoMax rhoMax       [ 1 -3 0 0 0 0 0 ]       500 ;
  pMin pMin       [ 1 -1 -2 0 0 0 0 ]       5e6 ;
  pMax pMax       [ 1 -1 -2 0 0 0 0 ]       11e6 ;  
  residualControl
  {
    p 0.0001;
    U 1e-05;
    h 1e-05; 	// possibly check turbulence fields
    "(k|epsilon|omega)" 0.001;
  }
}

relaxationFactors
{
  fields
  {
    p 0.3;
    rho 0.05;
  }
  equations
  {
    U 0.7;
    k 0.5;
    epsilon 0.5;
    h 0.5;
    nuTilda 0.5;
  }
} 	// ************************************************************************* //

